2023-04-20-SwapBookkeeping/notes.org
** Problem Statement and Our Solution

Suppose we have a list of elements and we want to simulate swap
operations on this list without modifying the actual data. We also want
to be able to retrieve the elements in their current order, reflecting
the simulated swap operations.

#+BEGIN_SRC python
data = ['alpha', 'beta', 'gamma', 'eta']
vec = Vector(data)

# swap 1-th and 3-th value
vec.swap(1, 3)
view = vec.view
expect_view = ['alpha', 'eta', 'gamma', 'beta']

assert all(view[i]==expect_view[i] for i in range(len(data)))

# swap 2-th and 3-th value
vec.swap(2, 3)
view = vec.view
expect_view = ['alpha', 'eta', 'beta', 'gamma']

assert all(view[i]==expect_view[i] for i in range(len(data)))

# restore data from view
restored_data = [view[i] for i in vec.addr2name]

assert all(data[i]==restored_data[i] for i in range(len(data)))
#+END_SRC

To address this problem, we propose the implementation of a class called
=Viewable_Mixin=. This class maintains two lists, =self.indices= and
=self.inverse_indices=, that store the forward and inverse mappings
between the view and the data, respectively. The =swap= method is used
to simulate swap operations on the view, while the =view= property
returns the current state of the view.

Below is the complete Python code that demonstrates how to simulate swap
operations without modifying the data using a simple class structure
called =Viewable_Mixin=:

#+BEGIN_SRC python
class Viewable_Mixin(object):
    '''Allow swap index without actually modifying the data.'''

    def __init__(self, *args, **kws):
        '''Assume data is a list'''
        super().__init__(*args, **kws)

        self.indices = list(range(len(self)))
        self.inverse_indices = list(range(len(self)))

    def swap(self, i, j):
        # swap i-th and j-th value without actually modifying data
        self.indices[i], self.indices[j] = self.indices[j], self.indices[i]

        # update inverse_indices
        self.inverse_indices[self.indices[i]] = i
        self.inverse_indices[self.indices[j]] = j

    def __getitem__(self, i):
        # return the view
        return super().__getitem__(self.indices[i])

    @property
    def view(self):
        return [self[i] for i in range(len(self))]

    @property
    def addr2name(self):
        return self.inverse_indices


class Vector(Viewable_Mixin, list):

    def __init__(self, *args, **kws):
        super().__init__(*args, **kws)


data = ['alpha', 'beta', 'gamma', 'eta']
vec = Vector(data)

# swap 1-th and 3-th value
vec.swap(1, 3)
view = vec.view
expect_view = ['alpha', 'eta', 'gamma', 'beta']

assert all(view[i] == expect_view[i] for i in range(len(data)))

# swap 2-th and 3-th value
vec.swap(2, 3)
view = vec.view
expect_view = ['alpha', 'eta', 'beta', 'gamma']

assert all(view[i] == expect_view[i] for i in range(len(data)))

# restore data from view
restored_data = [view[i] for i in vec.addr2name]

assert all(data[i]==restored_data[i] for i in range(len(data)))
#+END_SRC

