2023-04-20-SwapBookkeeping/notes.html

<div id="outline-container-org817dfff" class="outline-2">
<h2 id="org817dfff">Problem Statement and Our Solution</h2>
<div class="outline-text-2" id="text-org817dfff">
<p>
Suppose we have a list of elements and we want to simulate swap
operations on this list without modifying the actual data. We also want
to be able to retrieve the elements in their current order, reflecting
the simulated swap operations.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">data</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'beta'</span>, <span style="color: #2aa198;">'gamma'</span>, <span style="color: #2aa198;">'eta'</span>]
<span style="color: #268bd2;">vec</span> = Vector(data)

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">swap 1-th and 3-th value</span>
vec.swap(1, 3)
<span style="color: #268bd2;">view</span> = vec.view
<span style="color: #268bd2;">expect_view</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'eta'</span>, <span style="color: #2aa198;">'gamma'</span>, <span style="color: #2aa198;">'beta'</span>]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(view[i]==expect_view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">swap 2-th and 3-th value</span>
vec.swap(2, 3)
<span style="color: #268bd2;">view</span> = vec.view
<span style="color: #268bd2;">expect_view</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'eta'</span>, <span style="color: #2aa198;">'beta'</span>, <span style="color: #2aa198;">'gamma'</span>]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(view[i]==expect_view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">restore data from view</span>
<span style="color: #268bd2;">restored_data</span> = [view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> vec.addr2name]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(data[i]==restored_data[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))
</pre>
</div>

<p>
To address this problem, we propose the implementation of a class called
<code>Viewable_Mixin</code>. This class maintains two lists, <code>self.indices</code> and
<code>self.inverse_indices</code>, that store the forward and inverse mappings
between the view and the data, respectively. The <code>swap</code> method is used
to simulate swap operations on the view, while the <code>view</code> property
returns the current state of the view.
</p>

<p>
Below is the complete Python code that demonstrates how to simulate swap
operations without modifying the data using a simple class structure
called <code>Viewable_Mixin</code>:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">Viewable_Mixin</span>(<span style="color: #657b83; font-weight: bold;">object</span>):
    <span style="color: #2aa198;">'''Allow swap index without actually modifying the data.'''</span>

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, *args, **kws):
        <span style="color: #2aa198;">'''Assume data is a list'''</span>
        <span style="color: #657b83; font-weight: bold;">super</span>().__init__(*args, **kws)

        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">indices</span> = <span style="color: #657b83; font-weight: bold;">list</span>(<span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(<span style="color: #859900; font-weight: bold;">self</span>)))
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">inverse_indices</span> = <span style="color: #657b83; font-weight: bold;">list</span>(<span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(<span style="color: #859900; font-weight: bold;">self</span>)))

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">swap</span>(<span style="color: #859900; font-weight: bold;">self</span>, i, j):
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">swap i-th and j-th value without actually modifying data</span>
        <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">indices</span>[<span style="color: #268bd2;">i</span>], <span style="color: #859900; font-weight: bold;">self</span>.<span style="color: #268bd2;">indices</span>[j] = <span style="color: #859900; font-weight: bold;">self</span>.indices[j], <span style="color: #859900; font-weight: bold;">self</span>.indices[i]

        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">update inverse_indices</span>
        <span style="color: #859900; font-weight: bold;">self</span>.inverse_indices[<span style="color: #859900; font-weight: bold;">self</span>.indices[i]] = i
        <span style="color: #859900; font-weight: bold;">self</span>.inverse_indices[<span style="color: #859900; font-weight: bold;">self</span>.indices[j]] = j

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__getitem__</span>(<span style="color: #859900; font-weight: bold;">self</span>, i):
        <span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">return the view</span>
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #657b83; font-weight: bold;">super</span>().__getitem__(<span style="color: #859900; font-weight: bold;">self</span>.indices[i])

    @<span style="color: #657b83; font-weight: bold;">property</span>
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">view</span>(<span style="color: #859900; font-weight: bold;">self</span>):
        <span style="color: #859900; font-weight: bold;">return</span> [<span style="color: #859900; font-weight: bold;">self</span>[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(<span style="color: #859900; font-weight: bold;">self</span>))]

    @<span style="color: #657b83; font-weight: bold;">property</span>
    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">addr2name</span>(<span style="color: #859900; font-weight: bold;">self</span>):
        <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #859900; font-weight: bold;">self</span>.inverse_indices


<span style="color: #859900; font-weight: bold;">class</span> <span style="color: #b58900;">Vector</span>(Viewable_Mixin, <span style="color: #657b83; font-weight: bold;">list</span>):

    <span style="color: #859900; font-weight: bold;">def</span> <span style="color: #268bd2;">__init__</span>(<span style="color: #859900; font-weight: bold;">self</span>, *args, **kws):
        <span style="color: #657b83; font-weight: bold;">super</span>().__init__(*args, **kws)


<span style="color: #268bd2;">data</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'beta'</span>, <span style="color: #2aa198;">'gamma'</span>, <span style="color: #2aa198;">'eta'</span>]
<span style="color: #268bd2;">vec</span> = Vector(data)

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">swap 1-th and 3-th value</span>
vec.swap(1, 3)
<span style="color: #268bd2;">view</span> = vec.view
<span style="color: #268bd2;">expect_view</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'eta'</span>, <span style="color: #2aa198;">'gamma'</span>, <span style="color: #2aa198;">'beta'</span>]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(view[i] == expect_view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">swap 2-th and 3-th value</span>
vec.swap(2, 3)
<span style="color: #268bd2;">view</span> = vec.view
<span style="color: #268bd2;">expect_view</span> = [<span style="color: #2aa198;">'alpha'</span>, <span style="color: #2aa198;">'eta'</span>, <span style="color: #2aa198;">'beta'</span>, <span style="color: #2aa198;">'gamma'</span>]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(view[i] == expect_view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))

<span style="color: #93a1a1;"># </span><span style="color: #93a1a1;">restore data from view</span>
<span style="color: #268bd2;">restored_data</span> = [view[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> vec.addr2name]

<span style="color: #859900; font-weight: bold;">assert</span> <span style="color: #657b83; font-weight: bold;">all</span>(data[i]==restored_data[i] <span style="color: #859900; font-weight: bold;">for</span> i <span style="color: #859900; font-weight: bold;">in</span> <span style="color: #657b83; font-weight: bold;">range</span>(<span style="color: #657b83; font-weight: bold;">len</span>(data)))
</pre>
</div>
</div>
</div>
