2023-04-20-SwapBookkeeping/notes.html

<div id="outline-container-explanation-of-the-implementation" class="outline-2">
<h2 id="explanation-of-the-implementation">Explanation of the Implementation</h2>
<div class="outline-text-2" id="text-explanation-of-the-implementation">
<p>
Our solution is based on creating a class called <code>Viewable_Mixin</code> that
maintains two lists: <code>self.indices</code> (name2addr) and
<code>self.inverse_indices</code> (addr2name). These lists represent the forward
and inverse mappings between the view and the data, respectively.
</p>

<p>
<code>self.indices</code> is initialized with a range of indices from 0 to the
length of the data minus 1. This list represents the mapping from the
view's indices to the data's indices. When we swap elements in the view,
we only swap their indices in this list, without actually modifying the
data.
</p>

<p>
<code>self.inverse_indices</code> is also initialized with a range of indices from
0 to the length of the data minus 1. This list represents the inverse
mapping from the data's indices to the view's indices. It is updated
whenever elements are swapped in the view, ensuring that the inverse
mapping remains consistent with the forward mapping.
</p>

<p>
The <code>swap</code> method takes two indices, i and j, and swaps the i-th and
j-th elements in the view without modifying the actual data. This is
achieved by swapping the corresponding indices in <code>self.indices</code> and
updating <code>self.inverse_indices</code>.
</p>

<p>
The <code>__getitem__</code> method is used to return the element in the view at a
given index. It does this by returning the data element at the index
specified by <code>self.indices[i]</code>.
</p>

<p>
Finally, the <code>view</code> and <code>addr2name</code> properties return the current state
of the view and the inverse mapping (<code>self.inverse_indices</code>),
respectively.
</p>
</div>
</div>

<div id="outline-container-conclusion" class="outline-2">
<h2 id="conclusion">Conclusion</h2>
<div class="outline-text-2" id="text-conclusion">
<p>
In this blog post, we have explored the problem of simulating swap
operations without modifying the underlying data. We provided a Python
code example that demonstrates how to achieve this using a simple class
structure called <code>Viewable_Mixin</code>. The solution maintains two lists,
<code>self.indices</code> and <code>self.inverse_indices</code>, to store the forward and
inverse mappings between the view and the data. By swapping elements in
the view and updating the mappings accordingly, we can efficiently
simulate swaps without modifying the actual data.
</p>

<p>
This approach can be useful in various applications, such as data
visualization, algorithm analysis, and undo/redo functionality, where it
is necessary to maintain multiple views of the same data or analyze the
impact of different permutations without affecting the underlying data.
</p>
</div>
</div>

<div id="outline-container-org3dac822" class="outline-2">
<h2 id="org3dac822">Mathematical Justifications</h2>
<div class="outline-text-2" id="text-org3dac822">
<p>
It is possible to interprete <code>indices</code> and <code>inverse_indices</code> as two permutation matrix. To see this, one may write <code>data</code> and <code>view</code> as two column vectors and note the following equations.
$$
</p>
\begin{aligned}
\begin{bmatrix}
1 & 0 & 0 & 0 \\
0 & 0 & 0 & 1 \\
0 & 1 & 0 & 0 \\
0 & 0 & 1 & 0
\end{bmatrix}
\begin{bmatrix}
\alpha \\ \beta \\ \gamma \\ \eta
\end{bmatrix}
&= \begin{bmatrix}
\alpha \\ \eta \\ \beta \\ \gamma
\end{bmatrix}, %
%
\\
%
\begin{bmatrix}
\alpha \\ \beta \\ \gamma \\ \eta
\end{bmatrix}
&= \begin{bmatrix}
1 & 0 & 0 & 0 \\
0 & 0 & 1 & 0 \\
0 & 0 & 0 & 1 \\
0 & 1 & 0 & 0
\end{bmatrix}
\begin{bmatrix}
\alpha \\ \eta \\ \beta \\ \gamma
\end{bmatrix}.
\end{aligned}
<p>
$$
Hence, <code>indices</code> represents the permutation matrix in the first equation, denoted by \(A\) below, and <code>inversed_indices</code> represents the matrix in the second equation, denoted by \(B\).
</p>

<p>
Clearly, \(AB=I\). Moreover, because \(A\) and \(B\) are othrogonal matrix, \(A=B^\intercal\) holds too.
</p>

<p>
In this point of view, <code>indices[i]</code> stores the unique column index <code>j</code> such that \(A_{ij}=1\),
\[ \sum_{j}A_{ij} \mathtt{data[j]} = \mathtt{view[i]} = \mathtt{data[indices[i]]}.\]
Similarly, <code>inversed_indices[i]</code> stores the unique column index <code>j</code> such that \(B_{ij}=1\),
\[ \sum_{j}B_{ij} \mathtt{view[j]} = \mathtt{data[i]} = \mathtt{view[inversed\_indices[i]]}.\]
For arbitary vector \(v\), we have (introduce the notation that \(\mathbb{I}[\mathtt{cond}]=1\) if and only if \(\mathtt{cond}\) is true)
\[ \begin{aligned}
(BAv)_i &= \sum_{k} \sum_{j} A_{ik} B_{kj} v_j \\
&= \sum_{k} \mathbb{I}(k=\mathtt{indices}[i]) \sum_{j} \mathbb{I}(j=\mathtt{inversed\_indices}[k]) \cdot v_j \\
&= \sum_{k} \mathbb{I}(k=\mathtt{indices}[i]) \cdot v[\mathtt{inversed\_indices}[k]] \\
&= v[\mathtt{inversed\_indices}[\mathtt{indices}[i]]].
\end{aligned}.\]
Thus, we have
\[ i = \mathtt{inversed\_indices}[\mathtt{indices}[i]]. \]
This is the reflection of the matrix equation \(BA=I\).
</p>

<p>
Now look back to the equation transforming <code>data</code> to <code>view</code>
</p>
\begin{equation}
\begin{aligned}
\begin{bmatrix}
\mathbb{I}(j = \mathtt{indices}[0]) \\
\mathbb{I}(j = \mathtt{indices}[1]) \\
\mathbb{I}(j = \mathtt{indices}[2]) \\
\mathbb{I}(j = \mathtt{indices}[3])
\end{bmatrix}
\begin{bmatrix}
\mathtt{data}[0] \\
\mathtt{data}[1] \\
\mathtt{data}[2] \\
\mathtt{data}[3]
\end{bmatrix}
&= \begin{bmatrix}
\mathtt{view}[0] \\
\mathtt{view}[1] \\
\mathtt{view}[2] \\
\mathtt{view}[3]
\end{bmatrix}
\end{aligned},
\end{equation}
<p>
where \(\mathbb{I}(j = \mathtt{indices}[0])\) denotes a row vector with subscript \(j\). To swap the <code>view</code> vector without modifying the <code>data</code> vector, we can swap rows of \(A\) to satisfying the transforming equation. For example, if we want to swap the $i<sub>1</sub>$-th and $i<sub>2</sub>$-th entry of <code>view</code>, we can create another indices to represent the new permutation matrix:
\[ \begin{cases}
\mathtt{indices}'[i_1] &= \mathtt{indices}[i_2],\\
\mathtt{indices}'[i_2] &= \mathtt{indices}[i_1],\\
\mathtt{indices}'[i] &= \mathtt{indices}[i],\quad \forall i\not\in\{i_1,i_2\}.
\end{cases}\]
The inversed indices need to update accordingly:
\[ \begin{cases}
j_1 = \mathtt{indices}[i_1], \\
j_2 = \mathtt{indices}[i_2], \\
\mathtt{inversed\_indices}'[j_1] &= \mathtt{inversed\_indices}[j_2],\\
\mathtt{inversed\_indices}'[j_2] &= \mathtt{inversed\_indices}[j_1],\\
\mathtt{inversed\_indices}'[j] &= \mathtt{inversed\_indices}[j],\quad \forall j\not\in\{j_1,j_2\},
\end{cases}\]
or in a more intuitive expression
\[ \begin{cases}
\mathtt{inversed\_indices}'[\mathtt{indices}'[i_1]] &= \mathtt{inversed\_indices}[\mathtt{indices}'[i_2]] = i_1,\\
\mathtt{inversed\_indices}'[\mathtt{indices}'[i_2]] &= \mathtt{inversed\_indices}[\mathtt{indices}'[i_1]] = i_2,\\
\mathtt{inversed\_indices}'[\mathtt{indices}'[i]] &= \mathtt{inversed\_indices}[\mathtt{indices}'[i]] = i,\quad \forall i\not\in\{i_1, i_2\},
\end{cases}\]
It's easy to verify that \(\mathtt{inversed\_indices}'\) is indeed the inverse mapping of \(\mathtt{indices}'\).
</p>
</div>
</div>
<div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-think.html">think</a> </div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
